export const ppts = [
  { id: '251020', title: '【slidev】排列组合：插空法、隔板法、捆绑法综合练习1', date: '2025-10-20' },
  { id: '251021', title: '测试', date: '2025-10-21' },
  { id: '251022', title: '【slidev】双曲换元？欧拉公式！这道数列题不需要注意力', date: '2025-10-22' },
  { id: '251114', title: '【slidev】《高中数学竞赛培优教程》好题：函数性质+组合数定义', date: '2025-11-14' },
  { id: '251117', title: '【slidev】f(f(n))=3n，求这道优雅数列题的通项公式，保姆级教程！', date: '2025-11-17' },
  { id: '251124', title: '【slidev】这道解三角形向量做法太需要注意力？保姆级拆解，一题3解，让你从容面对！', date: '2025-11-24' },
  { id: '251126', title: '【slidev】深圳第一次模拟联测这道极值点偏移不简单！保姆级讲解，学渣也能听懂~', date: '2025-11-26' },
  { id: '251128', title: '【slidev】上期视频极值点偏移问题的命题背景揭晓！给各位出道导数压轴题~', date: '2025-11-28' },
  { id: '251204', title: '【slidev】大题造火箭！长郡二十校26届高三12月联考三角导数压轴', date: '2025-12-04' },
  { id: '251209', title: '【slidev】湖南师大附中26届高三第4次月考数论题和一道类似的竞赛题串讲', date: '2025-12-09' },
  { id: '251210', title: '【slidev】纳西妲遇到两道涉及数论的数列题，哥哥姐姐们可以帮帮她吗', date: '2025-12-10' },
];

export function hasPpt(id: string) {
  return ppts.some((ppt) => ppt.id === id);
}
